{"id": "1", "title": "Albert Einstein", "contents": "Albert Einstein was a German-born theoretical physicist who developed the theory of relativity, one of the two pillars of modern physics. His work also influenced the philosophy of science. In 1921, he received the Nobel Prize in Physics for his explanation of the photoelectric effect, which established quantum theory. Einstein's intellectual achievements and originality made the word 'Einstein' synonymous with genius. Over his lifetime, he published more than 300 scientific papers along with over 150 non-scientific works, discussing philosophy, humanism, and political issues. During his career he was affiliated with several prestigious institutions, including the Swiss Patent Office, the University of Zurich, and the Institute for Advanced Study at Princeton. In the 1930s, when the Nazi regime rose to power, Einstein emigrated to the United States and became a leading voice for peace and civil liberties. His theories not only reshaped our understanding of space and time but also opened the door to technologies like GPS, nuclear energy, and semiconductors, profoundly shaping modern life."}
{"id": "2", "title": "Marie Curie", "contents": "Marie Curie was a pioneering physicist and chemist who conducted groundbreaking research on radioactivity, a term that she herself coined. She was the first woman to win a Nobel Prize, and remains the only person ever awarded Nobel Prizes in two different scientific fields—physics and chemistry. Curie’s discoveries of polonium and radium revolutionized science and medicine, laying the foundation for modern radiotherapy for cancer treatment. Working in an era when women were rarely allowed in laboratories, she overcame immense social and institutional barriers. Her notebooks and instruments, even today, remain highly radioactive and are stored in lead-lined boxes. During World War I, Curie developed mobile X-ray units to assist battlefield surgeons, personally driving and operating these 'Little Curies'. Her legacy continues in the fields of physics, chemistry, and medical science, inspiring generations of researchers to pursue scientific discovery despite obstacles."}
{"id": "3", "title": "Isaac Newton", "contents": "Isaac Newton, an English mathematician, physicist, astronomer, and author, is widely recognized as one of the most influential scientists of all time. In his landmark 1687 work 'Philosophiæ Naturalis Principia Mathematica', he formulated the laws of motion and universal gravitation, which dominated scientists’ view of the physical universe for the next three centuries. Newton's work on optics, where he demonstrated that white light is composed of the colors of the visible spectrum, laid the foundation for modern physical optics. He also built the first practical reflecting telescope, now known as the Newtonian telescope. Beyond science, Newton was deeply involved in alchemy and biblical chronology and served as Warden of the Royal Mint, where he helped reform England’s currency. His relentless pursuit of knowledge, ranging from the celestial mechanics of planets to the chemical transformations of metals, reshaped our understanding of nature and established the framework of classical mechanics that underpins much of modern engineering and physics."}
{"id": "4", "title": "Ada Lovelace", "contents": "Ada Lovelace, born Augusta Ada Byron, is celebrated as the world’s first computer programmer. The daughter of the poet Lord Byron, she was introduced to mathematics and logic at an early age and demonstrated extraordinary talent. Her most notable contribution came from her collaboration with Charles Babbage on his proposed Analytical Engine, a mechanical general-purpose computer. In her notes on the engine, Lovelace described how the machine could be instructed to perform a sequence of operations and even to manipulate symbols in a way that anticipated modern software. Crucially, she predicted that computers could go beyond numerical calculation to manipulate text, music, and graphics—visionary ideas far ahead of her time. Although her work was not widely recognized during her lifetime, Lovelace’s insights have become foundational in computing history. Her foresight continues to inspire computer scientists, especially women in STEM, to push the boundaries of what machines can achieve."}
{"id": "5", "title": "Alan Turing", "contents": "Alan Turing was a British mathematician, logician, and cryptanalyst whose groundbreaking work laid the theoretical foundation for modern computer science and artificial intelligence. During World War II, Turing led a team at Bletchley Park that successfully broke the German Enigma code, an achievement that significantly shortened the war and saved countless lives. His design for the Automatic Computing Engine (ACE) introduced fundamental concepts of stored programs and universal computation, directly influencing the architecture of modern digital computers. Turing’s 1950 paper 'Computing Machinery and Intelligence' posed the question 'Can machines think?' and proposed what is now known as the Turing Test, a criterion for machine intelligence. Despite his scientific achievements, Turing was persecuted under British law for his homosexuality, leading to his tragic death in 1954. In 2013, he was posthumously pardoned, and today he is celebrated as a pioneer whose vision of intelligent machines continues to shape AI research and technology development worldwide."}