{"id": "2066692", "contents": "Truman Sports Complex The Harry S. Truman Sports Complex is a sports and entertainment facility located in Kansas City, Missouri. It is home to two major sports venues: Arrowhead Stadium—home of the National Football League's Kansas City Chiefs, and Kauffman Stadium—home of Major League Baseball's Kansas City Royals. The complex also hosts various other events during the year."}
{"id": "15106858", "contents": "Arrowhead Stadium 1970s practice would eventually spread to the other NFL stadiums as the 1970s progressed, finally becoming mandatory league-wide in the 1978 season (after being used in Super Bowl XII), and become almost near-universal at the lower levels of football. On January 20, 1974, Arrowhead Stadium hosted the Pro Bowl. Due to an ice storm and brutally cold temperatures the week leading up to the game, the game's participants worked out at the facilities of the San Diego Chargers. On game day, the temperature soared to 41 F, melting most of the ice and snow that accumulated during the week. The AFC defeated the NFC, 15–13."}
{"id": "15106858", "contents": "1971 Kansas City Chiefs season Season Summary Wilson, both of whom were named to the Pro Bowl. Podolak and Warren McVea handled the bulk of the return duties. The season was the last for the Chiefs in Municipal Stadium, as owner Lamar Hunt and general manager Jack Steadman were overseeing the construction of Arrowhead Stadium, located at the junction of Interstate 70 and Interstate 435 in Jackson County, Missouri, at the eastern edge of the Kansas City city limits. Arrowhead, along with Royals Stadium, being constructed for the Kansas City Royals of Major League Baseball, would form the Truman Sports Complex, bucking the trend of multi-purpose stadiums in vogue at the "}
{"id": "3999722", "contents": "History of the Kansas City metropolitan area 1960s United States in terms of area, while it placed 40th in population rankings. In 1967, the Kansas City Chiefs participated in the first ever Super Bowl, losing to the Green Bay Packers. That same year, Charlie Finley got permission to move the Kansas City Athletics out of the 1923-era Municipal Stadium. Kansas City responded to these developments by approving a bond issue to build the Truman Sports Complex on the extreme suburban eastern edge of the city by the intersection of Interstates 70 and 435. The construction of the complex was so successful that many major league ballparks and football stadiums have been designed in accordance with the Truman Complex master plan, and most have been designed by Kansas City architects. Also in 1967, "}
{"id": "3999722", "contents": "Multi-purpose Replacement and retention stadium The first real departure from the multipurpose stadium design occurred in 1972, when the Jackson County Sports Authority in Kansas City, Missouri, opened the Truman Sports Complex, which houses Kauffman Stadium (named Royals Stadium at the time of opening) and Arrowhead Stadium. The Truman Sports Complex was the first example of multiple stadiums being built for specific sports at the same time. The designers, Kivett and Myers, were then absorbed by Kansas City architecture firm Hellmuth, Obata, and Kassabaum to become HOK Sport + Venue + Event (now the independent firm Populous), which went on to design many professional sports venues "}